# üìä Data Analysis Practice

- üö¢ **Passenger Dataset** (Titanic-style synthetic data) ‚Äî basic exploration, filtering, and aggregation
- üìö **Bookstore Sales Data** (orders / books / customers tables) ‚Äî data merging practice

---
### üìã Learning Objectives

| Step | Concept | Key Functions |
|------|--------|--------------|
| 1 | Merge multiple tables | `pd.merge()` ‚Äî inner / left / right / outer |
| 2 | Check missing values | `isnull()` |
| 3 | Count unique values | `nunique()`, `unique()` |
| 4 | Conditional filtering | `df[df['col'] == value]`, `&`, `|` |
| 5 | Frequency analysis | `value_counts()` |
| 6 | Grouped aggregation | `groupby()` |
| 7 | Practice exercises | Solve it yourself ‚úèÔ∏è |

### 2-2. Basic Exploration Functions

After loading the data, always check its overall structure using the following functions:

| Function | Description |
|----------|-------------|
| `df.shape` | Returns (rows, columns) |
| `df.columns` | List of column names |
| `df.info()` | Data types & null summary |
| `df.describe()` | Descriptive statistics |
| `df.tail(n)` | Last n rows |

In [20]:
import pandas as pd
titanic = pd.read_csv('/Users/adfz088/Downloads/titanic.csv')

In [ ]:
# Data dictionary : https://www.kaggle.com/c/titanic/data

print("N of Row and Column:", titanic.shape)
print()

print("Columns:")
print(titanic.columns.tolist())

N of Row and Column: (891, 12)

Columns:
['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

In [ ]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [1]:
pip install pygwalker

Collecting pygwalker
  Downloading pygwalker-0.5.0.0-py3-none-any.whl.metadata (23 kB)
Collecting anywidget (from pygwalker)
  Downloading anywidget-0.9.21-py3-none-any.whl.metadata (8.9 kB)
Requirement already satisfied: appdirs in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (1.4.4)
Requirement already satisfied: arrow in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (1.3.0)
Collecting astor (from pygwalker)
  Using cached astor-0.8.1-py2.py3-none-any.whl.metadata (4.2 kB)
Requirement already satisfied: cachetools in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (5.5.2)
Collecting duckdb<2.0.0,>=0.10.4 (from pygwalker)
  Downloading duckdb-1.4.4-cp313-cp313-macosx_11_0_arm64.whl.metadata (4.3 kB)
Collecting gw-dsl-parser==0.1.49.1 (from pygwalker)
  Using cached gw_dsl_parser-0.1.49.1-py3-none-any.whl.metadata (1.2 kB)
Collecting ipylab<=1.0.0 (from pygwalker)
  Using cached ipylab-1.0.0-py3-none-any.whl.metadata (6.7 kB)
Requirement already satisfied: ipython in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (8.30.0)
Requirement already satisfied: ipywidgets in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (8.1.5)
Requirement already satisfied: jinja2 in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (3.1.6)
Collecting kanaries-track==0.0.5 (from pygwalker)
  Using cached kanaries_track-0.0.5-py3-none-any.whl.metadata (913 bytes)
Requirement already satisfied: numpy in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (2.2.3)
Requirement already satisfied: packaging in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (24.1)
Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (2.2.3)
Requirement already satisfied: psutil in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (5.9.0)
Requirement already satisfied: pyarrow in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (19.0.0)
Requirement already satisfied: pydantic in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (2.10.6)
Requirement already satisfied: pytz in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (2025.1)
Collecting quickjs (from pygwalker)
  Using cached quickjs-1.19.4.tar.gz (456 kB)
  Preparing metadata (setup.py) ... done
Requirement already satisfied: requests in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (2.32.3)
Collecting segment-analytics-python==2.2.3 (from pygwalker)
  Using cached segment_analytics_python-2.2.3-py2.py3-none-any.whl.metadata (1.6 kB)
Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (2.0.39)
Collecting sqlglot>=23.15.8 (from pygwalker)
  Downloading sqlglot-28.10.1-py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: traitlets in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (5.14.3)
Requirement already satisfied: typing-extensions in /opt/anaconda3/lib/python3.13/site-packages (from pygwalker) (4.12.2)
Collecting wasmtime>=12.0.0 (from gw-dsl-parser==0.1.49.1->pygwalker)
  Downloading wasmtime-41.0.0-py3-none-macosx_11_0_arm64.whl.metadata (5.5 kB)
Collecting backoff>=2.2.1 (from kanaries-track==0.0.5->pygwalker)
  Using cached backoff-2.2.1-py3-none-any.whl.metadata (14 kB)
Collecting dateutils>=0.6.12 (from kanaries-track==0.0.5->pygwalker)
  Using cached dateutils-0.6.12-py2.py3-none-any.whl.metadata (1.3 kB)
Collecting monotonic~=1.5 (from segment-analytics-python==2.2.3->pygwalker)
  Using cached monotonic-1.6-py2.py3-none-any.whl.metadata (1.5 kB)
Requirement already satisfied: python-dateutil~=2.2 in /opt/anaconda3/lib/python3.13/site-packages (from segment-analytics-python==2.2.3->pygwalker) (2.9.0.post0)
Requirement already satisfied: comm>=0.1.3 in /opt/anaconda3/lib/python3.13/site-packages (from ipywidgets->pygwalker) (0.2.1)
Requirement already satisfied: widgetsnbextension~=4.0.12 in /opt/anaconda3/lib/python3.13/site-packages (from ipywidgets->pygwalker) (4.0.13)
Requirement already satisfied: jupyterlab-widgets~=3.0.12 in /opt/anaconda3/lib/python3.13/site-packages (from ipywidgets->pygwalker) (3.0.13)
Requirement already satisfied: decorator in /opt/anaconda3/lib/python3.13/site-packages (from ipython->pygwalker) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /opt/anaconda3/lib/python3.13/site-packages (from ipython->pygwalker) (0.19.2)
Requirement already satisfied: matplotlib-inline in /opt/anaconda3/lib/python3.13/site-packages (from ipython->pygwalker) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in /opt/anaconda3/lib/python3.13/site-packages (from ipython->pygwalker) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in /opt/anaconda3/lib/python3.13/site-packages (from ipython->pygwalker) (2.19.1)
Requirement already satisfied: stack-data in /opt/anaconda3/lib/python3.13/site-packages (from ipython->pygwalker) (0.2.0)
Requirement already satisfied: pexpect>4.3 in /opt/anaconda3/lib/python3.13/site-packages (from ipython->pygwalker) (4.8.0)
Requirement already satisfied: charset-normalizer<4,>=2 in /opt/anaconda3/lib/python3.13/site-packages (from requests->pygwalker) (3.4.1)
Requirement already satisfied: idna<4,>=2.5 in /opt/anaconda3/lib/python3.13/site-packages (from requests->pygwalker) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in /opt/anaconda3/lib/python3.13/site-packages (from requests->pygwalker) (2.3.0)
Requirement already satisfied: certifi>=2017.4.17 in /opt/anaconda3/lib/python3.13/site-packages (from requests->pygwalker) (2025.1.31)
Collecting psygnal>=0.8.1 (from anywidget->pygwalker)
  Downloading psygnal-0.15.1-cp313-cp313-macosx_11_0_arm64.whl.metadata (6.1 kB)
Requirement already satisfied: MarkupSafe>=2.0 in /opt/anaconda3/lib/python3.13/site-packages (from jinja2->pygwalker) (2.1.5)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.13/site-packages (from pandas->pygwalker) (2025.1)
Requirement already satisfied: annotated-types>=0.6.0 in /opt/anaconda3/lib/python3.13/site-packages (from pydantic->pygwalker) (0.7.0)
Requirement already satisfied: pydantic-core==2.27.2 in /opt/anaconda3/lib/python3.13/site-packages (from pydantic->pygwalker) (2.27.2)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in /opt/anaconda3/lib/python3.13/site-packages (from jedi>=0.16->ipython->pygwalker) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /opt/anaconda3/lib/python3.13/site-packages (from pexpect>4.3->ipython->pygwalker) (0.7.0)
Requirement already satisfied: wcwidth in /opt/anaconda3/lib/python3.13/site-packages (from prompt-toolkit<3.1.0,>=3.0.41->ipython->pygwalker) (0.2.5)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.13/site-packages (from python-dateutil~=2.2->segment-analytics-python==2.2.3->pygwalker) (1.17.0)
Requirement already satisfied: executing in /opt/anaconda3/lib/python3.13/site-packages (from stack-data->ipython->pygwalker) (0.8.3)
Requirement already satisfied: asttokens in /opt/anaconda3/lib/python3.13/site-packages (from stack-data->ipython->pygwalker) (3.0.0)
Requirement already satisfied: pure-eval in /opt/anaconda3/lib/python3.13/site-packages (from stack-data->ipython->pygwalker) (0.2.2)
Downloading pygwalker-0.5.0.0-py3-none-any.whl (4.8 MB)
   ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 4.8/4.8 MB 45.0 MB/s eta 0:00:00a 0:00:01
Using cached gw_dsl_parser-0.1.49.1-py3-none-any.whl (956 kB)
Using cached kanaries_track-0.0.5-py3-none-any.whl (8.6 kB)
Using cached segment_analytics_python-2.2.3-py2.py3-none-any.whl (24 kB)
Downloading duckdb-1.4.4-cp313-cp313-macosx_11_0_arm64.whl (13.7 MB)
   ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 13.7/13.7 MB 57.5 MB/s eta 0:00:0000:0100:01
Using cached ipylab-1.0.0-py3-none-any.whl (100 kB)
Downloading sqlglot-28.10.1-py3-none-any.whl (597 kB)
   ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 597.1/597.1 kB 36.5 MB/s eta 0:00:00
Downloading anywidget-0.9.21-py3-none-any.whl (231 kB)
   ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 231.8/231.8 kB 18.1 MB/s eta 0:00:00
Using cached astor-0.8.1-py2.py3-none-any.whl (27 kB)
Using cached backoff-2.2.1-py3-none-any.whl (15 kB)
Using cached dateutils-0.6.12-py2.py3-none-any.whl (5.7 kB)
Using cached monotonic-1.6-py2.py3-none-any.whl (8.2 kB)
Downloading psygnal-0.15.1-cp313-cp313-macosx_11_0_arm64.whl (574 kB)
   ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 574.8/574.8 kB 34.8 MB/s eta 0:00:00
Downloading wasmtime-41.0.0-py3-none-macosx_11_0_arm64.whl (6.5 MB)
   ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 6.5/6.5 MB 59.0 MB/s eta 0:00:00a 0:00:01
Building wheels for collected packages: quickjs
  Building wheel for quickjs (setup.py) ... done
  Created wheel for quickjs: filename=quickjs-1.19.4-cp313-cp313-macosx_11_0_arm64.whl size=423533 sha256=52e2517cf195eb68c1b9c3b5a93b71279212f622b79d916a15b6369d03dd83f3
  Stored in directory: /Users/adfz088/Library/Caches/pip/wheels/38/bc/7e/5d94b7364161fe6785fc942ad6e9b167e491fd8175b66b3d06
Successfully built quickjs
Installing collected packages: quickjs, monotonic, wasmtime, sqlglot, psygnal, duckdb, backoff, astor, segment-analytics-python, gw-dsl-parser, dateutils, kanaries-track, ipylab, anywidget, pygwalker
Successfully installed anywidget-0.9.21 astor-0.8.1 backoff-2.2.1 dateutils-0.6.12 duckdb-1.4.4 gw-dsl-parser-0.1.49.1 ipylab-1.0.0 kanaries-track-0.0.5 monotonic-1.6 psygnal-0.15.1 pygwalker-0.5.0.0 quickjs-1.19.4 segment-analytics-python-2.2.3 sqlglot-28.10.1 wasmtime-41.0.0

[notice] A new release of pip is available: 24.0 -> 26.0.1
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [8]:
import pygwalker as pyg
pyg.walk(titanic)

Box(children=(HTML(value='\n<div id="ifr-pyg-00064b336cd6ebb4XimRPdobxHaGKYvq" style="height: auto">\n    <hea‚Ä¶

In [13]:
pip install ydata-profiling

Requirement already satisfied: ydata-profiling in /opt/anaconda3/lib/python3.13/site-packages (4.17.0)
Requirement already satisfied: scipy<1.16,>=1.4.1 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (1.15.3)
Requirement already satisfied: pandas!=1.4.0,<3.0,>1.1 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (2.2.3)
Requirement already satisfied: matplotlib<=3.10,>=3.5 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (3.10.0)
Requirement already satisfied: pydantic>=2 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (2.10.6)
Requirement already satisfied: PyYAML<6.1,>=5.0.0 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (6.0.2)
Requirement already satisfied: jinja2<3.2,>=2.11.1 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (3.1.6)
Requirement already satisfied: visions<0.8.2,>=0.7.5 in /opt/anaconda3/lib/python3.13/site-packages (from visions[type_image_path]<0.8.2,>=0.7.5->ydata-profiling) (0.8.1)
Requirement already satisfied: numpy<2.2,>=1.16.0 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (2.1.3)
Requirement already satisfied: minify-html>=0.15.0 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (0.16.4)
Requirement already satisfied: filetype>=1.0.0 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (1.2.0)
Requirement already satisfied: phik<0.13,>=0.11.1 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (0.12.5)
Requirement already satisfied: requests<3,>=2.24.0 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (2.32.3)
Requirement already satisfied: tqdm<5,>=4.48.2 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (4.67.1)
Requirement already satisfied: seaborn<0.14,>=0.10.1 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (0.13.2)
Requirement already satisfied: multimethod<2,>=1.4 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (1.12)
Requirement already satisfied: statsmodels<1,>=0.13.2 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (0.14.4)
Requirement already satisfied: typeguard<5,>=3 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (4.4.4)
Requirement already satisfied: imagehash==4.3.1 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (4.3.1)
Requirement already satisfied: wordcloud>=1.9.3 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (1.9.4)
Requirement already satisfied: dacite>=1.8 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (1.9.2)
Requirement already satisfied: numba<=0.61,>=0.56.0 in /opt/anaconda3/lib/python3.13/site-packages (from ydata-profiling) (0.61.0)
Requirement already satisfied: PyWavelets in /opt/anaconda3/lib/python3.13/site-packages (from imagehash==4.3.1->ydata-profiling) (1.8.0)
Requirement already satisfied: pillow in /opt/anaconda3/lib/python3.13/site-packages (from imagehash==4.3.1->ydata-profiling) (11.1.0)
Requirement already satisfied: MarkupSafe>=2.0 in /opt/anaconda3/lib/python3.13/site-packages (from jinja2<3.2,>=2.11.1->ydata-profiling) (2.1.5)
Requirement already satisfied: contourpy>=1.0.1 in /opt/anaconda3/lib/python3.13/site-packages (from matplotlib<=3.10,>=3.5->ydata-profiling) (1.3.1)
Requirement already satisfied: cycler>=0.10 in /opt/anaconda3/lib/python3.13/site-packages (from matplotlib<=3.10,>=3.5->ydata-profiling) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in /opt/anaconda3/lib/python3.13/site-packages (from matplotlib<=3.10,>=3.5->ydata-profiling) (4.55.3)
Requirement already satisfied: kiwisolver>=1.3.1 in /opt/anaconda3/lib/python3.13/site-packages (from matplotlib<=3.10,>=3.5->ydata-profiling) (1.4.8)
Requirement already satisfied: packaging>=20.0 in /opt/anaconda3/lib/python3.13/site-packages (from matplotlib<=3.10,>=3.5->ydata-profiling) (24.1)
Requirement already satisfied: pyparsing>=2.3.1 in /opt/anaconda3/lib/python3.13/site-packages (from matplotlib<=3.10,>=3.5->ydata-profiling) (3.2.0)
Requirement already satisfied: python-dateutil>=2.7 in /opt/anaconda3/lib/python3.13/site-packages (from matplotlib<=3.10,>=3.5->ydata-profiling) (2.9.0.post0)
Requirement already satisfied: llvmlite<0.45,>=0.44.0dev0 in /opt/anaconda3/lib/python3.13/site-packages (from numba<=0.61,>=0.56.0->ydata-profiling) (0.44.0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.13/site-packages (from pandas!=1.4.0,<3.0,>1.1->ydata-profiling) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.13/site-packages (from pandas!=1.4.0,<3.0,>1.1->ydata-profiling) (2025.1)
Requirement already satisfied: joblib>=0.14.1 in /opt/anaconda3/lib/python3.13/site-packages (from phik<0.13,>=0.11.1->ydata-profiling) (1.4.2)
Requirement already satisfied: charset-normalizer<4,>=2 in /opt/anaconda3/lib/python3.13/site-packages (from requests<3,>=2.24.0->ydata-profiling) (3.4.1)
Requirement already satisfied: idna<4,>=2.5 in /opt/anaconda3/lib/python3.13/site-packages (from requests<3,>=2.24.0->ydata-profiling) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in /opt/anaconda3/lib/python3.13/site-packages (from requests<3,>=2.24.0->ydata-profiling) (2.3.0)
Requirement already satisfied: certifi>=2017.4.17 in /opt/anaconda3/lib/python3.13/site-packages (from requests<3,>=2.24.0->ydata-profiling) (2025.1.31)
Requirement already satisfied: patsy>=0.5.6 in /opt/anaconda3/lib/python3.13/site-packages (from statsmodels<1,>=0.13.2->ydata-profiling) (1.0.1)
Requirement already satisfied: typing_extensions>=4.14.0 in /opt/anaconda3/lib/python3.13/site-packages (from typeguard<5,>=3->ydata-profiling) (4.15.0)
Requirement already satisfied: attrs>=19.3.0 in /opt/anaconda3/lib/python3.13/site-packages (from visions<0.8.2,>=0.7.5->visions[type_image_path]<0.8.2,>=0.7.5->ydata-profiling) (24.3.0)
Requirement already satisfied: networkx>=2.4 in /opt/anaconda3/lib/python3.13/site-packages (from visions<0.8.2,>=0.7.5->visions[type_image_path]<0.8.2,>=0.7.5->ydata-profiling) (3.4.2)
Requirement already satisfied: puremagic in /opt/anaconda3/lib/python3.13/site-packages (from visions<0.8.2,>=0.7.5->visions[type_image_path]<0.8.2,>=0.7.5->ydata-profiling) (1.30)
Requirement already satisfied: annotated-types>=0.6.0 in /opt/anaconda3/lib/python3.13/site-packages (from pydantic>=2->ydata-profiling) (0.7.0)
Requirement already satisfied: pydantic-core==2.27.2 in /opt/anaconda3/lib/python3.13/site-packages (from pydantic>=2->ydata-profiling) (2.27.2)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.13/site-packages (from python-dateutil>=2.7->matplotlib<=3.10,>=3.5->ydata-profiling) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
import numpy as np  
from ydata_profiling import ProfileReport

profile = ProfileReport(df=titanic)

In [28]:
profile.to_file("./profile_report.html")

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]

---
## Step 3: Merging DataFrames

Real-world data is often stored across multiple tables.
Using `pd.merge()`, we can combine tables based on a **common key column**.

```python
pd.merge(df_left, df_right, on='key', how='join_type')
```

### Join Types

inner join ‚Üí rows present in both tables
left join ‚Üí keep all rows from the left table
right join ‚Üí keep all rows from the right table
outer join ‚Üí keep all rows from both tables

### Practice Data: Bookstore System
- üì¶ **orders** : Order information
- üìö **books** : Book details
- üë§ **customers** : Customer information

In [32]:
orders = pd.DataFrame({
    'order_id':    [1, 2, 3, 4, 5, 6, 7, 8],
    'book_id':     [101, 102, 101, 103, 104, 102, 105, 101],
    'customer_id': [201, 202, 203, 201, 204, 205, 202, None],
    'quantity':    [2, 1, 3, 1, 2, 1, 4, 1],
    'order_date':  ['2024-01-05','2024-01-07','2024-01-08','2024-01-10',
                    '2024-01-12','2024-01-15','2024-01-18','2024-01-20']
})

print("üì¶ orders")
orders

üì¶ orders

   order_id  book_id  customer_id  quantity  order_date
0         1      101        201.0         2  2024-01-05
1         2      102        202.0         1  2024-01-07
2         3      101        203.0         3  2024-01-08
3         4      103        201.0         1  2024-01-10
4         5      104        204.0         2  2024-01-12
5         6      102        205.0         1  2024-01-15
6         7      105        202.0         4  2024-01-18
7         8      101          NaN         1  2024-01-20

In [33]:
books = pd.DataFrame({
    'book_id': [101, 102, 103, 104, 106],
    'title':   ['Harry-Potter', 'Lord of the Rings', 'Little Prince', 'Demian', 'Norwegian Wood'],
    'genre':   ['fantasy', 'fantasy', 'Literature', 'Literature', 'Novel'],
    'price':   [18000, 22000, 12000, 14000, 16000]
})

print("üìö books")
books

üìö books

   book_id              title       genre  price
0      101       Harry-Potter     fantasy  18000
1      102  Lord of the Rings     fantasy  22000
2      103      Little Prince  Literature  12000
3      104             Demian  Literature  14000
4      106     Norwegian Wood       Novel  16000

In [34]:
customers = pd.DataFrame({
    'customer_id': [201, 202, 203, 204, 205, 206],
    'name':    ['Kim', 'Lee', 'Park', 'Choi', 'Chung', 'Han'],
    'age':     [28, 34, 22, 41, 30, 27],
    'city':    ['Seoul', 'Busan', 'Seoul', 'Daegu', 'Incheon', 'Gwangju'],
    'country': ['KR', 'KR', 'KR', 'KR', 'KR', 'KR']
})

print("üë§ customers")
customers

üë§ customers

   customer_id   name  age     city country
0          201    Kim   28    Seoul      KR
1          202    Lee   34    Busan      KR
2          203   Park   22    Seoul      KR
3          204   Choi   41    Daegu      KR
4          205  Chung   30  Incheon      KR
5          206    Han   27  Gwangju      KR

### 3-1. Inner Join ‚Äî Only Matching Data

In [17]:
# Inner join: orders + books
merged_inner = pd.merge(orders, books, on='book_id', how='inner')

print(f"rows of orders       : {len(orders)}")
print(f"rows after inner join : {len(merged_inner)}")
print("book_id=105 is excluded \n")
merged_inner

rows of orders       : 8
rows after inner join : 7
book_id=105 is excluded

,order_id,book_id,customer_id,quantity,order_date,title,genre,price
0,1,101,201.0,2,2024-01-05,Harry-Potter,fantasy,18000
1,2,102,202.0,1,2024-01-07,Lord of the Rings,fantasy,22000
2,3,101,203.0,3,2024-01-08,Harry-Potter,fantasy,18000
3,4,103,201.0,1,2024-01-10,Little Prince,Literature,12000
4,5,104,204.0,2,2024-01-12,Demian,Literature,14000
5,6,102,205.0,1,2024-01-15,Lord of the Rings,fantasy,22000
6,8,101,NaN,1,2024-01-20,Harry-Potter,fantasy,18000

### 3-2. Left Join ‚Äî Based on Left Table

In [ ]:
merged_left = pd.merge(orders, books, on='book_id', how='left')

print(f"rows after left join: {len(merged_left)}")
print("‚Üí book_id=105 is included, but title/genre/price are NaN!\n")
merged_left

rows after left join: 8
‚Üí book_id=105 is included, but title/genre/price are NaN!

,order_id,book_id,customer_id,quantity,order_date,title,genre,price
0,1,101,201.0,2,2024-01-05,Harry-Potter,fantasy,18000.0
1,2,102,202.0,1,2024-01-07,Lord of the Rings,fantasy,22000.0
2,3,101,203.0,3,2024-01-08,Harry-Potter,fantasy,18000.0
3,4,103,201.0,1,2024-01-10,Little Prince,Literature,12000.0
4,5,104,204.0,2,2024-01-12,Demian,Literature,14000.0
5,6,102,205.0,1,2024-01-15,Lord of the Rings,fantasy,22000.0
6,7,105,202.0,4,2024-01-18,NaN,NaN,NaN
7,8,101,NaN,1,2024-01-20,Harry-Potter,fantasy,18000.0

### 3-3. Second Merge ‚Äî Add Customer Information

In [35]:
# Translated comment
final_df = pd.merge(merged_inner, customers, on='customer_id', how='left')

print(f"final shape: {final_df.shape}")
print()
final_df

final shape: (7, 12)

,order_id,book_id,customer_id,quantity,order_date,title,genre,price,name,age,city,country
0,1,101,201.0,2,2024-01-05,Harry-Potter,fantasy,18000,Kim,28.0,Seoul,KR
1,2,102,202.0,1,2024-01-07,Lord of the Rings,fantasy,22000,Lee,34.0,Busan,KR
2,3,101,203.0,3,2024-01-08,Harry-Potter,fantasy,18000,Park,22.0,Seoul,KR
3,4,103,201.0,1,2024-01-10,Little Prince,Literature,12000,Kim,28.0,Seoul,KR
4,5,104,204.0,2,2024-01-12,Demian,Literature,14000,Choi,41.0,Daegu,KR
5,6,102,205.0,1,2024-01-15,Lord of the Rings,fantasy,22000,Chung,30.0,Incheon,KR
6,8,101,NaN,1,2024-01-20,Harry-Potter,fantasy,18000,NaN,NaN,NaN,NaN

---
## Step 4: Checking Missing Values (Null)

Data may contain missing values (`NaN`).
Before analysis, we should identify and decide how to handle them.

| Code | Description |
|------|-------------|
| `df.isnull().sum()` | Number of missing values |
| `df.isnull().mean() * 100` | Percentage of missing values |
| `df[df['col'].isnull()]` | Filter rows with null |
| `df[df['col'].notnull()]` | Filter rows without null |

In [37]:

print(" N of Null:")
titanic.isnull().sum()

 N of Null:

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [42]:
null_ratio = (titanic.isnull().sum() / len(titanic) * 100).round(1)
print("Null ratio (%):")
null_ratio[null_ratio > 0]

Null ratio (%):

Age         19.9
Cabin       77.1
Embarked     0.2
dtype: float64

In [46]:

age_null_df = titanic[titanic['Age'].isnull()]

print(f"N of no age information: {len(age_null_df)}Î™Ö")
age_null_df[['Survived','Pclass','Sex','Age','Fare']].head(10)

N of no age information: 177Î™Ö

    Survived  Pclass     Sex  Age      Fare
5          0       3    male  NaN    8.4583
17         1       2    male  NaN   13.0000
19         1       3  female  NaN    7.2250
26         0       3    male  NaN    7.2250
28         1       3  female  NaN    7.8792
29         0       3    male  NaN    7.8958
31         1       1  female  NaN  146.5208
32         1       3  female  NaN    7.7500
36         1       3    male  NaN    7.2292
42         0       3    male  NaN    7.8958

In [47]:

print("Í≥†Í∞ù IDÍ∞Ä ÏóÜÎäî Ï£ºÎ¨∏:")
orders[orders['customer_id'].isnull()]

Í≥†Í∞ù IDÍ∞Ä ÏóÜÎäî Ï£ºÎ¨∏:

   order_id  book_id  customer_id  quantity  order_date
7         8      101          NaN         1  2024-01-20

In [48]:
print("final_df Í≤∞Ï∏°Í∞í Ïàò:")
final_df.isnull().sum()

final_df Í≤∞Ï∏°Í∞í Ïàò:

order_id       0
book_id        0
customer_id    1
quantity       0
order_date     0
title          0
genre          0
price          0
name           1
age            1
city           1
country        1
dtype: int64

---
## Step 5: Unique Values

Use these functions to understand what types of values exist in a column.

| Function | Output | Description |
|----------|--------|-------------|
| `df['col'].nunique()` | int | Number of unique values |
| `df['col'].unique()` | array | List of unique values |

In [50]:

print("embark_town:", titanic['Embarked'].nunique())
print("embark_town  :", titanic['Embarked'].unique())

embark_town: 3
embark_town  : ['S' 'C' 'Q' nan]

In [54]:

print("Unique value per column:")
titanic[['Pclass','Sex','Embarked']].nunique()

Unique value per column:

Pclass      3
Sex         2
Embarked    3
dtype: int64

In [55]:

print("N of unique customers:", final_df['customer_id'].nunique())
print()
print("N of unique genre  :", final_df['genre'].nunique())
print("Unique genre :", final_df['genre'].unique())

N of unique customers: 5

N of unique genre  : 2
Unique genre : ['fantasy' 'Literature']

---
## Step 6: Conditional Filtering

Selecting rows based on conditions is one of the most common tasks in data analysis.

```python
df[df['column'] == 'value']
df[df['column'] != 'value']
df[df['column'] > number]

df[(cond1) & (cond2)]
df[(cond1) | (cond2)]
```

> ‚ö†Ô∏è Wrap each condition in parentheses when combining multiple conditions.

In [ ]:

first_class = titanic[titanic['Pclass'] == 1]

print(f"N of first class: {len(first_class)}Î™Ö")
first_class[['Survived','Pclass','Sex','Age','Fare']].head(8)

N of first class: 216Î™Ö

    Survived  Pclass     Sex   Age      Fare
1          1       1  female  38.0   71.2833
3          1       1  female  35.0   53.1000
6          0       1    male  54.0   51.8625
11         1       1  female  58.0   26.5500
23         1       1    male  28.0   35.5000
27         0       1    male  19.0  263.0000
30         0       1    male  40.0   27.7208
31         1       1  female   NaN  146.5208

In [58]:

survived_1st_female = titanic[
    (titanic['Pclass'] == 1) &
    (titanic['Sex'] == 'female') &
    (titanic['Survived'] == 1)
]

print(f"N of female in the first_class : {len(survived_1st_female)} ")
survived_1st_female[['Survived','Pclass','Sex','Age','Fare']].head()

N of female in the first_class : 91

    Survived  Pclass     Sex   Age      Fare
1          1       1  female  38.0   71.2833
3          1       1  female  35.0   53.1000
11         1       1  female  58.0   26.5500
31         1       1  female   NaN  146.5208
52         1       1  female  49.0   76.7292

In [61]:

elderly = titanic[titanic['Age'] >= 60]

print(f"N of passengers over 60: {len(elderly)}Î™Ö")

survival_rate = elderly['Survived'].mean() * 100
print(f"Survival rate of passengers over 60: {survival_rate:.1f}%")

N of passengers over 60: 26Î™Ö
Survival rate of passengers over 60: 26.9%

In [64]:

sq_passengers = titanic[
    (titanic['Embarked'] == 'S') |
    (titanic['Embarked'] == 'Q')
]

print(f"N of embarking from Southampton or Queenstown: {len(sq_passengers)}Î™Ö")

N of embarking from Southampton or Queenstown: 721Î™Ö

In [67]:

fantasy_orders = final_df[final_df['genre'] == 'fantasy']

print(f"N of Fantasy orders: {len(fantasy_orders)}")
fantasy_orders

N of Fantasy orders: 5

,order_id,book_id,customer_id,quantity,order_date,title,genre,price,name,age,city,country
0,1,101,201.0,2,2024-01-05,Harry-Potter,fantasy,18000,Kim,28.0,Seoul,KR
1,2,102,202.0,1,2024-01-07,Lord of the Rings,fantasy,22000,Lee,34.0,Busan,KR
2,3,101,203.0,3,2024-01-08,Harry-Potter,fantasy,18000,Park,22.0,Seoul,KR
5,6,102,205.0,1,2024-01-15,Lord of the Rings,fantasy,22000,Chung,30.0,Incheon,KR
6,8,101,NaN,1,2024-01-20,Harry-Potter,fantasy,18000,NaN,NaN,NaN,NaN

---
## Step 7: Frequency Analysis (value_counts)

`value_counts()` counts how often each unique value appears.

```python
df['column'].value_counts()
df['column'].value_counts(normalize=True)
df['column'].value_counts(ascending=True)
```

In [82]:
# Translated comment
print("N of customers per city:")
final_df['city'].value_counts()

N of customers per city:

city
Seoul      3
Busan      1
Daegu      1
Incheon    1
Name: count, dtype: int64

---
## Step 8: Grouped Aggregation (GroupBy)

`groupby()` groups data based on a column and applies aggregation functions.

```python
df.groupby('group')['target'].mean()
```

Common aggregation functions:
- `.mean()`
- `.median()`
- `.sum()`
- `.count()`
- `.max()` / `.min()`

In [69]:
print("average age group by pclass:")
print(titanic.groupby('Pclass')['Age'].mean().round(1))
print()
print("median age group by pclass:")
print(titanic.groupby('Pclass')['Age'].median().round(1))

average age group by pclass:
Pclass
1    38.2
2    29.9
3    25.1
Name: Age, dtype: float64

median age group by pclass:
Pclass
1    37.0
2    29.0
3    24.0
Name: Age, dtype: float64

In [ ]:

survival_by_sex = titanic.groupby('Sex')['Survived'].mean() * 100
print("survival rate group by sex (%):")
survival_by_sex.round(1)

survival rate per sex (%):

Sex
female    74.2
male      18.9
Name: Survived, dtype: float64

In [74]:
# Translated comment
print("average book price group by genre:")
final_df.groupby('genre')['price'].mean()

average book price group by genre:

genre
Literature    13000.0
fantasy       19600.0
Name: price, dtype: float64

In [75]:
# Translated comment
print("sum of order quantity group by city:")
final_df.groupby('city')['quantity'].sum().sort_values(ascending=False)

sum of order quantity group by city:

city
Seoul      6
Daegu      2
Busan      1
Incheon    1
Name: quantity, dtype: int64

In [79]:
# Translated comment
print("Survival rate of Pclass √ó Sex (%):")
(titanic.groupby(['Pclass','Sex'])['Survived'].mean() * 100).round(1)

Survival rate of Pclass √ó Sex (%):

Pclass  Sex
1       female    96.8
        male      36.9
2       female    92.1
        male      15.7
3       female    50.0
        male      13.5
Name: Survived, dtype: float64

---
## ‚úèÔ∏è Exercises

### Q1 ‚Äî Filter Missing Values

From the passenger dataset, filter rows where the 'Pclass' column is missing and count them.

In [84]:
deck_null = titanic[titanic['Pclass'].isnull()]
deck_null

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

### Q2 ‚Äî Count Unique Values

How many types of 'Pclass' exist? Print both the count and the list.

In [89]:
titanic['Pclass'].nunique()
titanic['Pclass'].unique()

array([3, 1, 2])

### Q3 ‚Äî Multiple Conditions

Filter passengers under 18 years old in 3rd class and calculate survival rate (%).

In [87]:
minor_3rd = titanic[(titanic['Age'] < 18) & (titanic['Pclass'] == 3)]
survival_rate = minor_3rd['Survived'].mean() * 100
survival_rate.round(1)

np.float64(37.2)

### Q5 ‚Äî groupby + median

Calculate median fare by passenger class.

In [91]:
fare_median = titanic.groupby('Pclass')['Fare'].median()

print(fare_median.sort_values(ascending=False))

Pclass
1    60.2875
2    14.2500
3     8.0500
Name: Fare, dtype: float64

### Q6 ‚Äî Merge Comparison

Outer join `orders` and `books`, then compare with inner join results.

In [92]:
merged_outer = pd.merge(orders, books, on='book_id', how='outer')
print(merged_outer)

   order_id  book_id  customer_id  quantity  order_date              title  \
0       1.0      101        201.0       2.0  2024-01-05       Harry-Potter
1       3.0      101        203.0       3.0  2024-01-08       Harry-Potter
2       8.0      101          NaN       1.0  2024-01-20       Harry-Potter
3       2.0      102        202.0       1.0  2024-01-07  Lord of the Rings
4       6.0      102        205.0       1.0  2024-01-15  Lord of the Rings
5       4.0      103        201.0       1.0  2024-01-10      Little Prince
6       5.0      104        204.0       2.0  2024-01-12             Demian
7       7.0      105        202.0       4.0  2024-01-18                NaN
8       NaN      106          NaN       NaN         NaN     Norwegian Wood

        genre    price
0     fantasy  18000.0
1     fantasy  18000.0
2     fantasy  18000.0
3     fantasy  22000.0
4     fantasy  22000.0
5  Literature  12000.0
6  Literature  14000.0
7         NaN      NaN
8       Novel  16000.0

### Q7 ‚Äî Advanced GroupBy

Filter passengers from Cherbourg and calculate average fare by sex and class.

In [96]:
cherbourg = titanic[titanic['Embarked'] == 'C']
result = cherbourg.groupby(['Sex','Pclass'])['Fare'].mean().round(1)
print(result.sort_values(ascending=False))

Sex     Pclass
female  1         115.6
male    1          93.5
        2          25.4
female  2          25.3
        3          14.7
male    3           9.4
Name: Fare, dtype: float64